import matplotlib
import matplotlib.pyplot as plt
matplotlib.use('TkAgg')

x = [1567, 1557, 1552, 1548, 1543, 1540, 1535, 1531, 1526, 1522, 1514, 1505, 1499, 1493, 1489,
     1563, 1574, 1579, 1585, 1588, 1590, 1592, 1597, 1600, 1604, 1608, 1615, 1625, 1641, 1648]
y = [9.8, 9.5, 9, 8.5, 7.8, 7.4, 6.8, 6.4, 5.8, 5.4, 4.6, 4.2, 3.8, 3.5, 3.4,
     9.8, 9.5, 9, 8.4, 8, 7.7, 7.4, 7.0, 6.6, 6.2, 5.8, 5.2, 4.6, 3.8, 3.5]

x_1 = [1573, 1547, 1525, 1518, 1498, 1487, 1474, 1462, 1451, 1430, 1420, 1390, 1370, 1352, 1316,
       1573, 1602, 1612, 1635, 1647, 1672, 1685, 1703, 1727, 1750, 1795, 1829, 1862, 1945, 2058]
y_1 = [10, 9.7, 9.2, 9, 8.4, 7.9, 7.4, 6.8, 6.5, 5.8, 5.5, 4.7, 4.2, 3.9, 3.4, 10, 9.7, 9.3, 8.8, 8.5,
       7.8, 7.4, 6.9, 6.4, 5.9, 5.2, 4.8, 4.4, 3.8, 3.4]

print(len(x_1), len(y_1))
x = [elem/1567 for elem in x]
y = [elem/9.8 for elem in y]

x_1 = [elem/1573 for elem in x_1]
y_1 = [elem/10 for elem in y_1]

graph1 = plt.scatter(x, y, s=7., color='green')
graph2 = plt.scatter(x_1, y_1, s=7., color='r', marker='^')
plt.grid()
plt.xlabel('$\\nu/\\nu_0$')
plt.ylabel('$U/U_0$')
plt.legend([graph1, graph2], ['R = 0 Ом', 'R = 100 Ом'])
plt.title('Резонансные кривые для R=0 Ом и R=100 Ом')
plt.savefig('graph_1')
plt.show()
